Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: wherein the processing circuitry (103) is further configured to implement a target direction renderer (103b), wherein the target direction renderer (103b) is configured to generate based on the input signal and the adjusted current target direction (301b) a first driving signal for driving the left ear transducer (101a) and a second driving signal for driving the right ear transducer (101b), wherein the target direction renderer (103b) is configured to select, based on the adjusted current target direction (301b), from a plurality of generic head related transfer functions, HRTFs, a first HRTF for generating the first driving signal and a second HRTF for generating the second driving signal, wherein the processing circuitry (103) is further configured to determine, in a first phase, an interaural time difference, ITD, correction based on a cross-head delay of the user (110), and wherein the processing circuitry (103) is configured to generate the first driving signal based on the first HRTF and the ITD correction and the second driving signal based on the second HRTF and the ITD correction, wherein the processing circuitry (103) is configured to determine the cross-head delay of the user (110) by generating, using the transducers (101a, 101b), noise bursts, wherein an interaural delay of each alternate pulse is shifted until an azimuthal shift in the position of the stimulus is just perceptible by the user (110) and the processing circuitry (103) is further configured to generate, in a second phase, the personalized adjustment function (103a) by measuring for the plurality of reference target directions of the reference sound signal the plurality of perceived reference target directions of the reference sound signal as perceived by the user (110).
de_de: wobei die Verarbeitungsschaltung (103) ferner konfiguriert ist, um einen Zielrichtungsrenderer (103b) zu implementieren, wobei der Zielrichtungsrenderer (103b) konfiguriert ist, um basierend auf dem Eingangssignal und der angepassten aktuellen Zielrichtung (301b) ein erstes Ansteuersignal zum Ansteuern des Wandlers (101a) für das linke Ohr und ein zweites Ansteuersignal zum Ansteuern des Wandlers (101b) für das rechte Ohr zu erzeugen, wobei der Zielrichtungsrenderer (103b) konfiguriert ist, um basierend auf der angepassten aktuellen Zielrichtung (301b) aus einer Vielzahl von generischen kopfbezogenen Transferfunktionen (HRTFs) eine erste HRTF zum Erzeugen des ersten Ansteuersignals und eine zweite HRTF zum Erzeugen des zweiten Ansteuersignals auszuwählen, wobei die Verarbeitungsschaltung (103) ferner konfiguriert ist, um in einer ersten Phase eine Korrektur der interauralen Zeitdifferenz (ITD) basierend auf einer Kreuzkopfverzögerung des Benutzers (110) zu bestimmen, und wobei die Verarbeitungsschaltung (103) dazu konfiguriert ist, das erste Ansteuersignal basierend auf der ersten HRTF und der ITD-Korrektur und das zweite Ansteuersignal basierend auf der zweiten HRTF zu erzeugen und die ITD-Korrektur, wobei die Verarbeitungsschaltung (103) dazu konfiguriert ist, die Kreuzkopfverzögerung des Benutzers (110) zu bestimmen durch Erzeugen, mithilfe der Wandler (101a, 101b), von Rauschbursts, wobei eine interaurale Verzögerung jedes abwechselnden Impulses verschoben wird, bis eine azimutale Verschiebung der Position des Stimulus von dem Benutzer (110) gerade noch wahrnehmbar ist, und die Verarbeitungsschaltung (103) ferner konfiguriert ist, um in einer zweiten Phase die personalisierte Anpassungsfunktion (103a) zu erzeugen durch Messen der Vielzahl von wahrgenommenen Referenzzielrichtungen des Referenztonsignals, wie von dem Benutzer (110) wahrgenommen, für die Vielzahl von Referenzzielrichtungen des Referenztonsignals.

source: 2. The apparatus (100) of claim 1, wherein the target direction renderer (103b) is configured to generate the first driving signal based on a convolution of the first HRTF with the input signal and the second driving signal based on a convolution of the second HRTF with the input signal.
de_de: 2. Vorrichtung (100) nach Anspruch 1, wobei der Zielrichtungsrenderer (103b) konfiguriert ist, um das erste Ansteuersignal basierend auf einer Faltung des ersten HRTF mit dem Eingangssignal und das zweite Ansteuersignal basierend auf einer Faltung des zweiten HRTF mit dem Eingangssignal zu erzeugen.

source: 3. The apparatus (100) of any one of claims 1 or 2, wherein the apparatus (100) further comprises a memory (105) configured to store the plurality of generic HRTFs.
de_de: 3. Vorrichtung (100) nach einem der Ansprüche 1 oder 2, wobei die Vorrichtung (100) ferner einen Speicher (105) umfasst, der konfiguriert ist, um die Vielzahl generischer HRTFs zu speichern.

source: 4. The apparatus (100) of any one of the preceding claims, wherein the processing circuitry (103) is configured to determine, based on the current target direction (301a) of the input signal, the adjusted current target direction (301b) using the personalized adjustment function (103a) by interpolating the adjusted current target direction (301b) using the plurality of perceived reference target directions.
de_de: 4. Vorrichtung (100) nach einem der vorhergehenden Ansprüche, wobei die Verarbeitungsschaltung (103) konfiguriert ist, um basierend auf der aktuellen Zielrichtung (301a) des Eingangssignals die angepasste aktuelle Zielrichtung (301b) mithilfe der personalisierten Anpassungsfunktion (103a) durch Interpolation der angepassten aktuellen Zielrichtung (301b) mithilfe der Vielzahl von wahrgenommenen Referenzzielrichtungen zu bestimmen.

source: 5. The apparatus (100) of any one of the preceding claims, wherein the processing circuitry (103) is further configured to generate the personalized adjustment function (103a) by detecting for the plurality of reference target directions of the reference sound signal the plurality of perceived reference target directions of the reference sound signal as perceived by the user (110).
de_de: 5. Vorrichtung (100) nach einem der vorhergehenden Ansprüche, wobei die Verarbeitungsschaltung (103) ferner konfiguriert ist, um die personalisierte Anpassungsfunktion (103a) zu erzeugen durch Detektieren der Vielzahl von wahrgenommenen Referenzzielrichtungen des Referenztonsignals, wie von dem Benutzer (110) wahrgenommen, für die Vielzahl von Referenzzielrichtungen des Referenztonsignals.

source: 6. Headphones comprising an apparatus (100) according to any one of the preceding claims.
de_de: 6. Kopfhörer, umfassend eine Vorrichtung (100) nach einem der vorhergehenden Ansprüche.

source: 7. A method (800) for personalized binaural audio rendering of an input signal, wherein the method (800) comprises:
de_de: 7. Verfahren (800) zur personalisierten binauralen Audiowiedergabe eines Eingangssignals, wobei das Verfahren (800) umfasst:

source: determining (801), based on a current target direction (301a) of the input signal, an adjusted current target direction (301b) using a personalized adjustment function (103a), wherein the personalized adjustment function (103a) describes a functional relationship between a plurality of reference target directions of a reference sound signal and a plurality of perceived reference target directions of the reference sound signal as perceived by a user (110);
de_de: Bestimmen (801), basierend auf einer aktuellen Zielrichtung (301a) des Eingangssignals einer angepassten aktuellen Zielrichtung (301b) mithilfe einer personalisierten Anpassungsfunktion (103a), wobei die personalisierte Anpassungsfunktion (103a) eine funktionale Beziehung zwischen einer Vielzahl von Referenzzielrichtungen eines Referenztonsignals und einer Vielzahl von wahrgenommenen Referenzzielrichtungen des Referenztonsignals, wie von einem Benutzer (110) wahrgenommen, beschreibt;

source: generating (803), based on the input signal and the adjusted current target direction (301b), a first driving signal for driving a left ear transducer (101a) and a second driving signal for driving a right ear transducer (101b); and
de_de: Erzeugen (803), basierend auf dem Eingangssignal und der angepassten aktuellen Zielrichtung (301b), eines ersten Ansteuersignals zum Ansteuern eines Wandlers (101a) für das linke Ohr und eines zweiten Ansteuersignals zum Ansteuern eines Wandlers (101b) für das rechte Ohr; und

source: generating (805) by the left ear transducer (101a) a left ear audio signal based on the first driving signal and by the right ear transducer (101b) a right ear audio signal based on the second driving signal,
de_de: Erzeugen (805) eines Audiosignals für das linke Ohr durch den Wandler (101a) für das linke Ohr basierend auf dem ersten Ansteuersignal und eines Audiosignals für das rechte Ohr durch den Wandler (101b) für das rechte Ohr basierend auf dem zweiten Ansteuersignal,

source: wherein generating (803) the first driving signal and the second driving signal comprises selecting, based on the adjusted current target direction (301b), from a plurality of generic head related transfer functions, HRTFs, a first HRTF for generating the first driving signal and a second HRTF for generating the second driving signal, wherein the method (800) further comprises determining in a first phase, an interaural time difference, ITD, correction based on a cross-head delay of the user (110), and
de_de: wobei ein Erzeugen (803) des ersten Ansteuersignals und des zweiten Ansteuersignals Auswählen einer ersten HRTF zum Erzeugen des ersten Ansteuersignals und einer zweiten HRTF zum Erzeugen des zweiten Ansteuersignals basierend auf der angepassten aktuellen Zielrichtung (301b) aus einer Vielzahl generischer kopfbezogener Transferfunktionen (HRTFs) umfasst, wobei das Verfahren (800) ferner ein Bestimmen in einer ersten Phase einer Korrektur der interauralen Zeitdifferenz (ITD) basierend auf einer Kreuzkopfverzögerung des Benutzers (110) umfasst, und

source: generating the first driving signal based on the first HRTF and the ITD correction and the second driving signal based on the second HRTF and the ITD correction, wherein the the cross-head delay of the user (110) is determined by generating, using the transducers (101a, 101b),
de_de: Erzeugen des ersten Ansteuersignals basierend auf der ersten HRTF und der ITD-Korrektur und des zweiten Ansteuersignals basierend auf der zweiten HRTF und der ITD-Korrektur, wobei die Kreuzkopfverzögerung des Benutzers (110) bestimmt wird durch Erzeugen, mithilfe der Wandler (101a, 101b),

source: noise bursts, wherein an interaural delay of each alternate pulse is shifted until an azimuthal shift in the position of the stimulus is just perceptible by the user (110) and generating, in a second phase, the personalized adjustment function (103a) by measuring for the plurality of reference target directions of the reference sound signal the plurality of perceived reference target directions of the reference sound signal as perceived by the user (110).
de_de: von Rauschbursts, wobei eine interaurale Verzögerung jedes abwechselnden Impulses verschoben wird, bis eine azimutale Verschiebung der Position des Stimulus von dem Benutzer (110) gerade noch wahrnehmbar ist, und Erzeugen, in einer zweiten Phase, der personalisierten Anpassungsfunktion (103a) durch Messen der Vielzahl von wahrgenommenen Referenzzielrichtungen des Referenztonsignals, wie von dem Benutzer (110) wahrgenommen, für die Vielzahl von Referenzzielrichtungen des Referenztonsignals.

source: 8. The method (800) of claim 7, wherein determining (801), based on the current target direction (301a) of the input signal, the adjusted current target direction (301b) using the personalized adjustment function (103a) comprises interpolating the adjusted current target direction (301b) using the plurality of perceived reference target directions.
de_de: 8. Verfahren (800) nach Anspruch 7, wobei ein Bestimmen (801) der angepassten aktuellen Zielrichtung (301b) basierend auf der aktuellen Zielrichtung (301a) des Eingangssignals mithilfe der personalisierten Anpassungsfunktion (103a) Interpolieren der angepassten aktuellen Zielrichtung (301b) mithilfe der Vielzahl von wahrgenommenen Referenzzielrichtungen umfasst.

source: 9. The method (800) of any one of claims 7 or 8, wherein the method (800) further comprises generating the personalized adjustment function (103a) by detecting for the plurality of reference target directions of the reference sound signal the plurality of perceived reference target directions of the reference sound signal as perceived by the user (110).
de_de: 9. Verfahren (800) nach einem der Ansprüche 7 oder 8, wobei das Verfahren (800) ferner Erzeugen der personalisierten Anpassungsfunktion (103a) durch Detektieren der Vielzahl von wahrgenommenen Referenzzielrichtungen des Referenztonsignals, wie von dem Benutzer (110) wahrgenommen, für die Vielzahl von Referenzzielrichtungen des Referenztonsignals umfasst.

source: A computer program product comprising a non-transitory computer-readable storage medium for storing program code which causes the apparatus of one of the claims 1 to 5 to perform the method (800) of any one of claims 7 to 9, when the program code is executed by the apparatus.
de_de: Computerprogrammprodukt, umfassend ein nichtflüchtiges computerlesbares Speichermedium zum Speichern von Programmcode, der die Vorrichtung nach einem der Ansprüche 1 bis 5 veranlasst, das Verfahren (800) nach einem der Ansprüche 7 bis 9 durchzuführen, wenn der Programmcode von der Vorrichtung ausgeführt wird.

source: 1. A method, by a receiver (200), comprising:
de_de: 1. Verfahren, durch einen Empfänger (200), umfassend:

source: receiving (202, 302, 1102) a signal (240) from a transmitter (250), via a communication channel between the receiver and the transmitter;
de_de: Empfangen (202, 302, 1102) eines Signals (240) von einem Sender (250) über einen Kommunikationskanal zwischen dem Empfänger und dem Sender;

source: estimating parameters (208, 304, 1104) associated with the channel based on the received signal;
de_de: Schätzen von Parametern (208, 304, 1104), die mit dem Kanal verknüpft sind, basierend auf dem empfangenen Signal;

source: obtaining magnitude information (210, 306, 1106) from the estimated parameters;
de_de: Erlangen von Größeninformationen (210, 306, 1106) aus den geschätzten Parametern;

source: converting the magnitude information (1108) from Rayleigh distribution to uniform distribution;
de_de: Umwandeln der Größeninformationen (1108) von einer Rayleigh-Verteilung in eine Gleichverteilung;

source: applying (212, 308, 1110) a trellis coded quantization, TCQ, scheme to the converted magnitude information by mapping each sub-codebook index of a set of sub-codebook indices to output bits of each pair of outgoing trellis branches (214) from each trellis node in order to make the distance between sub-codebooks maximally equal; and
de_de: Anwenden (212, 308, 1110) eines trellis-codierten Quantisierungs-Schemas (TCQ-Schemas) auf die umgewandelten Größeninformationen durch Abbilden jedes Subcodebuchindex eines Satzes von Subcodebuchindizes auf Ausgangsbits jedes Paares ausgehender Trelliszweige (214) von jedem Trellisknoten, um den Abstand zwischen den Subcodebüchern so gleich wie möglich zu machen; und

source: transmitting a channel state information, CSI, measurement feedback (242, 310, 1112) to the transmitter, the CSI measurement feedback based on the application of the TCQ scheme to the converted magnitude information and comprising one or more of: a beginning state, input bits to the TCQ scheme, and a sub-codebook index (218).
de_de: Übertragen einer Kanalzustandsinformations-(CSI-)Messrückkopplung (242, 310, 1112) an den Sender, wobei die CSI-Messrückkoppung auf der Anwendung des TCQ-Schemas auf die umgewandelten Größeninformationen basiert und eines oder mehrere der folgenden Elemente umfasst: einen Anfangszustand, Eingangsbits für das TCQ-Schema und einen Subcodebuchindex (218).

source: 2. The method of claim 1 further comprising: executing a Viterbi algorithm, VA (216), to obtain the CSI measurement feedback.
de_de: 2. Verfahren nach Anspruch 1, ferner umfassend: Ausführen eines Viterbi-Algorithmus (VA) (216), um die CSI-Messrückkopplung zu erlangen.

source: 3. The method of claim 1 or 2, wherein the set of sub-codebook indices comprises 4 sub-codebook indices.
de_de: 3. Verfahren nach Anspruch 1 oder 2, wobei der Satz von Subcodebuchindizes 4 Subcodebuchindizes umfasst.

source: 4. The method of any one of claims 1 to 3, wherein each sub-codebook of the set of sub-codebooks comprises a set of codewords generated via:
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei jedes Subcodebuch des Satzes von Subcodebüchern einen Satz von Codewörtern umfasst, die erzeugt werden über:

source: , wherein:
de_de: , wobei:

source: is the l-th codeword in sub-codebook ,
de_de: das l-te Codewort in dem Subcodebuch ist,

source: -th sub-codebook is denoted as ;
de_de: das -te Subcodebuch als bezeichnet wird;

source: n = bit size of the TCQ scheme;
de_de: n = Bitgröße des TCQ-Schemas;

source: ; and
de_de: ; und

source: Lb and Ub are, respectively, lower bound and upper bound of the converted magnitude information.
de_de: Lb und Ub jeweils die Untergrenze und Obergrenze der konvertierten Größeninformationen sind.

source: 5. The method of claim 4, wherein Lb is 0 and Ub is 1.
de_de: 5. Verfahren nach Anspruch 4, wobei Lb 0 ist und Ub 1 ist.

source: 6. The method of any one of claims 1 to 5, wherein the converting is performed via:
de_de: 6. Verfahren nach einem der Ansprüche 1 bis 5, wobei das Umwandeln durchgeführt wird über:

source: U is the converted magnitude information uniformly distributed between 0 and 1;
de_de: U die umgewandelte Größeninformation ist, die gleichmäßig zwischen 0 und 1 verteilt ist;

source: σ is a scaling factor as determined according to: ;
de_de: σ ein Skalierungsfaktor ist, der gemäß folgender Formel bestimmt wird: ;

source: μ(x) is an average over an OFDM symbol for a portion of the magnitude information from each measured CSI per sub-carrier; and
de_de: μ(x) ein Durchschnitt über einem OFDM-Symbol für einen Abschnitt der Größeninformationen aus jedem gemessenen CSI pro Subträger ist; und

source: x is the magnitude information.
de_de: x die Größeninformation ist.

source: 7. The method of claim 6, wherein the transmitting comprises transmitting the scaling factor.
de_de: 7. Verfahren nach Anspruch 6, wobei das Übertragen das Übertragen des Skalierungsfaktors umfasst.

source: 8. The method of claim 7, wherein the scaling factor is quantized once per sensing frame.
de_de: 8. Verfahren nach Anspruch 7, wobei der Skalierungsfaktor einmal pro Erfassungsrahmen quantisiert wird.

source: 9. The method of claim 7 or 8, wherein the scaling factor comprises an integer part and a decimal part.
de_de: 9. Verfahren nach Anspruch 7 oder 8, wobei der Skalierungsfaktor einen ganzzahligen Teil und einen Dezimalteil umfasst.

source: The method of claim 9, wherein the integer part and the decimal part are quantized separately.
de_de: Verfahren nach Anspruch 9, wobei der ganzzahlige Teil und der Dezimalteil separat quantisiert werden.

source: The method of claim 10, wherein the decimal part is quantized using a scalar quantization.
de_de: Verfahren nach Anspruch 10, wobei der Dezimalteil mithilfe einer skalaren Quantisierung quantisiert wird.

source: The method of any of claims 7 to 11 further comprising:
de_de: Verfahren nach einem der Ansprüche 7 bis 11, ferner umfassend:

source: recovering, by the transmitter, the converted magnitude information; and
de_de: Wiederherstellen der umgewandelten Größeninformationen durch den Sender; und

source: reconverting the magnitude information according to: .
de_de: Zurückumwandeln der Größeninformationen gemäß: .

source: A wireless device (200, 1200) comprising:
de_de: Drahtlose Vorrichtung (200, 1200), umfassend:

source: a receiver, (204, 1260) configured to receive (202) a signal (240) from a transmitter (250), via a communication channel between the receiver and the transmitter (250);
de_de: einen Empfänger (204, 1260), der konfiguriert ist, um über einen Kommunikationskanal zwischen dem Empfänger und dem Sender (250) ein Signal (240) von einem Sender (250) zu empfangen (202);

source: a channel estimation unit (208), configured to estimate parameters associated with the channel based on the received signal;
de_de: eine Kanalschätzeinheit (208), die konfiguriert ist, um mit dem Kanal verknüpfte Parameter basierend auf dem empfangenen Signal zu schätzen;

source: an information derivation unit (210) configured to: obtaining magnitude information from the estimated parameters, and convert the magnitude information from Rayleigh distribution to uniform distribution;
de_de: eine Informationsableitungseinheit (210), die konfiguriert ist, um: Größeninformationen aus den geschätzten Parametern zu erlangen und die Größeninformationen von einer Rayleigh-Verteilung in eine Gleichverteilung umzuwandeln;

source: a quantization unit (212) configured to apply a trellis coded quantization, TCQ, scheme to the converted magnitude information by mapping each sub-codebook index of a set of sub-codebook indices to output bits of each pair of outgoing trellis branches (214) of each trellis node, making the distance between sub-codebooks maximally equal; and
de_de: eine Quantisierungseinheit (212), die konfiguriert ist, um ein trelliscodiertes Quantisierungs-Schema (TCQ-Schema) auf die umgewandelten Größeninformationen durch Abbilden jedes Subcodebuchindexes eines Satzes von Subcodebuchindizes auf Ausgangsbits jedes Paares ausgehender Trelliszweige (214) jedes Trellisknotens anzuwenden, und somit den Abstand zwischen den Subcodebüchern so gleich wie möglich zu machen; und

source: a transmitter antenna (206) configured to transmit a channel state information, CSI, measurement feedback (242) to the transmitter (250), the CSI measurement feedback based on the application of the TCQ scheme to the converted magnitude information and comprising one or more of: a beginning state, input bits to the TCQ scheme, and a sub-codebook index (218).
de_de: eine Sendeantenne (206), die konfiguriert ist, um eine Kanalzustandsinformations-(CSI-)Messrückkopplung (242) an den Sender (250) zu übertragen, wobei die CSI-Messrückkopplung auf der Anwendung des TCQ-Schemas auf die umgewandelten Größeninformationen basiert und eines oder mehrere der folgenden Elemente umfasst: einen Anfangszustand, Eingangsbits für das TCQ-Schema und einen Subcodebuchindex (218).

source: A non-transitory memory (1120) storing machine executable instructions, which when executed by a processor (1210) of a wireless device (200,1200), cause the wireless device (200,1200) to carry out the method according to claims 1 to 11.
de_de: Nichtflüchtiger Speicher (1120), der maschinenausführbare Anweisungen speichert, die, wenn sie von einem Prozessor (1210) einer drahtlosen Vorrichtung (200, 1200) ausgeführt werden, die drahtlose Vorrichtung (200, 1200) dazu veranlassen, das Verfahren nach den Ansprüchen 1 bis 11 durchzuführen.

source: What is claimed is:
de_de: Patentansprüche:

source: 1. A quick application processing method to improve a page display speed of a quick application, applied to a terminal device, wherein the method comprises:
de_de: 1. Verfahren zur Schnellanwendungsverarbeitung, um eine Seitenanzeigegeschwindigkeit einer Schnellanwendung zu verbessern, das auf einem Endgerät angewendet wird, wobei das Verfahren umfasst:

source: in response to a page opening operation on a target quick application (S210), sending a preprocessed-data request to a first server (S220);
de_de: als Reaktion auf einen Seitenöffnungsvorgang in einer Zielschnellanwendung (S210) Senden einer Anforderung vorverarbeiteter Daten an einen ersten Server (S220);
